tap "derailed/k9s"
tap "noborus/tap"

# Core brews
brew "python"
brew "poetry"
brew "ipython"
brew "pipx"
brew "exa"
brew "bat"
brew "fd"
brew "httpie"
brew "chezmoi"
brew "asdf"
brew "nushell"

# Fish utils
brew "fish"
brew "fisher"

# Standard utils
brew "wget"
brew "git"
brew "git-lfs"
brew "curl"
brew "yarn"
brew "awscli", link: !ENV['CI']
brew "terraform"

# GNU stuff
brew "gnu-sed"
brew "coreutils"
brew "findutils"
brew "parallel"
brew "screen"
brew "nano"
brew "watch"
brew "htop"

# Useful utilities
brew "ncdu"
brew "tokei"
brew "pv"
brew "fzf"
brew "tree"
brew "ripgrep"
brew "jq"
brew "youtube-dl"
brew "watchman"
brew "pstree"
brew "ffmpeg"
brew "tealdeer"
brew "pgcli"
brew "gpg"
brew "gping"
brew "git-workspace"
brew "nanorc"
brew "pre-commit"
brew "graphviz"
brew "entr"
brew "gh"
brew "git-delta"
brew "ov" # From noborus/tap/
brew "skopeo"
brew "twine-pypi"

# Cargo plugins
brew "rust", link: false  # Don't link, as it clashes with rustup.
brew "cargo-watch"
brew "cargo-release"
brew "cargo-outdated"

# Kubernetes and Docker
brew "podman"
brew "kubectl"
brew "stern"
brew "kubectx"
brew "dive"
brew "derailed/k9s/k9s"

# Other
brew "defaultbrowser"

# For alfred plugins
brew "php"

# Common build deps
brew "cmake"
brew "pkg-config"
