tap "derailed/k9s"
tap "noborus/tap"

# Core brews
brew "python"
brew "poetry"
brew "ipython"
brew "pipx"
brew "eza"
brew "bat"
brew "fd"
brew "httpie"
brew "chezmoi"
brew "nushell"
brew "starship"
brew "mise"

# Fish utils
brew "fish"
brew "fisher"

# Standard utils
brew "wget"
brew "wget2"
brew "git"
brew "git-lfs"
brew "curl"
brew "yarn"
brew "awscli", link: !ENV['CI']
brew "terraform"
brew "aws-vault"

# GNU stuff
brew "gnu-sed"
brew "gnu-tar"
brew "coreutils"
brew "findutils"
brew "parallel"
brew "screen"
brew "nano"
brew "watch"
brew "htop"

# My tools
brew "gping"
brew "git-workspace"
brew "hq"

# Useful utilities
brew "ncdu"
brew "tokei"
brew "pv"
brew "fzf"
brew "tree"
brew "ripgrep"
brew "jq"
brew "yt-dlp"
brew "pstree"
brew "ffmpeg"
brew "tealdeer"
brew "pgcli"
brew "litecli"
brew "gpg"
brew "nanorc"
brew "pre-commit"
brew "graphviz"
brew "entr"
brew "gh"
brew "git-delta"
brew "ov" # From noborus/tap/
brew "skopeo"
brew "twine-pypi"
brew "go"
brew "xsv"
brew "shfmt"
brew "shellcheck"
brew "glow"
brew "sd"
brew "hexyl"
brew "miller"
brew "steampipe"
brew "duckdb"
brew "unar"
brew "libmagic"
brew "trash"

# Cargo plugins
brew "cargo-watch"
brew "cargo-release"
brew "cargo-outdated"

# Kubernetes and Docker
brew "kubectl"
brew "stern"
brew "kubectx"
brew "dive"
brew "derailed/k9s/k9s"

# Other
brew "defaultbrowser"

# For alfred plugins
brew "php"

# Common build deps
brew "cmake"
brew "pkg-config"

# for fix-code-permissions.sh
brew "duti"
